app/views/movies/index.html.haml

SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1'
---
			-if @OrderBy == "title"
				%th.hilite= link_to "Movie Title", movies_path({:OrderBy => "title", :ratings => Hash[@selected_ratings.map{|v| [v, 1]}] })