app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1'
SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
  	@all_ratings = Movie.getUniqueMovieRatings
  	if(params[:ratings])
  		#queryString = "rating = ?"
  		#firstPass = true
  		#params[:ratings].keys.each do |temp|
  			#if(!firstPass)
  				#queryString += " OR rating = ?"
  			#end
  			#firstPass = false
  		#end
    	@movies = Movie.where(rating: params[:ratings].keys).order(params[:OrderBy])
    else
    	@movies = Movie.order(params[:OrderBy])